modules/models/Admin.php

SELECT * FROM `shop_admin` WHERE adminuser = 'admin' and adminpass ='e10adc3949ba59abbe56e057f20f883e'
---
	public function validatePass(){
		if (!$this->hasErrors()) {
			$data = self::find()->where('adminuser = :user and adminpass =:pass', [':user'=>$this->adminuser,":pass"=>md5($this->adminpass)])->one();

UPDATE `shop_admin` SET `adminpass`='0192023a7bbd73250516f069df18b500' WHERE adminuser = 'admin'
---
	function changePass($data){
		$this->scenario = 'changepass';
		if ($this->load($data) && $this->validate()) {
			return $this->updateAll(['adminpass'=>md5($this->adminpass)],'adminuser = :user',[':user'=>$this->adminuser]);

UPDATE `shop_admin` SET `adminemail`='897416591@qq.com' WHERE adminuser = 'admin'
---
	public function changeEmail($data){
		$this->scenario = 'changeemail';
		if ($this->load($data) && $this->validate()) {
			return (bool)$this->updateAll(['adminemail'=>$this->adminemail],'adminuser = :user',[':user'=>$this->adminuser]);